app/views/menus/index.html.erb

SELECT `menus`.* FROM `menus`
SELECT `submenus`.* FROM `submenus` WHERE `submenus`.`menu_id` = '1'
---
                              </tr>
                              <% menu.submenus.each do |submenu| %>