app/views/stride/home.html.erb

      <a class="navbar-brand" href="#">
        <% if @logos.present? %><%= image_tag(@logos.last.image, :width => '70px') %><% else %><%= image_tag("Logo-USB1.png", :width => '70px') %>
---
SELECT  `logos`.* FROM `logos` ORDER BY `logos`.`id` DESC LIMIT 1

    </div>
    <% Menu.all.each do |menu| %>
---
SELECT `menus`.* FROM `menus`

          <li><%= menu.name %></li>
          <% menu.submenus.each do |submenu| %>
---
SELECT `menus`.* FROM `menus`
SELECT `submenus`.* FROM `submenus` WHERE `submenus`.`menu_id` = '1'