app/views/headers/show.html.erb


<% Nav.all.each do |menu| %>
---
SELECT `navs`.* FROM `navs`