app/controllers/headers_controller.rb

  def index
    @headers = Header.all
---
SELECT `headers`.* FROM `headers`

  def create
    @header = Header.new(header_params)

    respond_to do |format|
      if @header.save
---
INSERT INTO `headers` (`created_at`, `updated_at`) VALUES ('2019-02-08 09:57:32', '2019-02-08 09:57:32')

  def update
    respond_to do |format|
      if @header.update(header_params)
---
UPDATE `headers` SET `updated_at` = '2019-02-08 09:57:32' WHERE `headers`.`id` = 2

    def set_header
      @header = Header.find(params[:id])
---
SELECT  `headers`.* FROM `headers` WHERE `headers`.`id` = 2 LIMIT 1