app/controllers/logos_controller.rb

  def index
    @logos = Logo.all
---
SELECT `logos`.* FROM `logos`

  def create
    @logo = Logo.new(logo_params)

    respond_to do |format|
      if @logo.save
---
INSERT INTO `logos` (`created_at`, `updated_at`) VALUES ('2019-02-13 15:46:37', '2019-02-13 15:46:37')

  def update
    respond_to do |format|
      if @logo.update(logo_params)
---
UPDATE `logos` SET `updated_at` = '2019-02-19 10:15:48' WHERE `logos`.`id` = 1

  def destroy
    @logo.destroy
---
DELETE FROM `logos` WHERE `logos`.`id` = 2

    def set_logo
      @logo = Logo.find(params[:id])
---
SELECT  `logos`.* FROM `logos` WHERE `logos`.`id` = 1 LIMIT 1