app/controllers/menus_controller.rb

SELECT `menus`.* FROM `menus`
---
  def index
    @menus = Menu.all

INSERT INTO `sub_menus` (`name`, `menu_id`, `created_at`, `updated_at`) VALUES ('Address', 2, '2019-02-07 08:00:52', '2019-02-07 08:00:52')
---
  def create
    @menu = Menu.new(menu_params)

    respond_to do |format|
      if @menu.save

UPDATE `menus` SET `name` = 'HOMED', `updated_at` = '2019-02-19 10:38:06' WHERE `menus`.`id` = 1
---
  def update
    respond_to do |format|
      if @menu.update(menu_params)

SELECT  `menus`.* FROM `menus` WHERE `menus`.`id` = 1 LIMIT 1
---
    def set_menu
      @menu = Menu.find(params[:id])