app/controllers/news_seconds_controller.rb

SELECT `news_seconds`.* FROM `news_seconds`
---
  def index
    @news_seconds = NewsSecond.all

INSERT INTO `news_seconds` (`heading`, `description`, `created_at`, `updated_at`) VALUES ('DFFFF', 'dfdf', '2019-02-14 17:28:10', '2019-02-14 17:28:10')
---
  def create
    @news_second = NewsSecond.new(news_second_params)

    respond_to do |format|
      if @news_second.save

UPDATE `news_seconds` SET `updated_at` = '2019-02-14 17:28:10' WHERE `news_seconds`.`id` = 1
---
  def update
    respond_to do |format|
      if @news_second.update(news_second_params)

SELECT  `news_seconds`.* FROM `news_seconds` WHERE `news_seconds`.`id` = 1 LIMIT 1
---
    def set_news_second
      @news_second = NewsSecond.find(params[:id])