app/controllers/news_firsts_controller.rb

  def index
    @news_firsts = NewsFirst.all
---
SELECT `news_firsts`.* FROM `news_firsts`

  def create
    @news_first = NewsFirst.new(news_first_params)

    respond_to do |format|
      if @news_first.save
---
INSERT INTO `news_firsts` (`heading`, `description`, `created_at`, `updated_at`) VALUES ('CHINTU', 'at garh ganesh ji', '2019-02-14 16:47:18', '2019-02-14 16:47:18')

  def update
    respond_to do |format|
      if @news_first.update(news_first_params)
---
UPDATE `news_firsts` SET `updated_at` = '2019-02-14 16:50:02' WHERE `news_firsts`.`id` = 2

  def destroy
    @news_first.destroy
---
DELETE FROM `news_firsts` WHERE `news_firsts`.`id` = 1

    def set_news_first
      @news_first = NewsFirst.find(params[:id])
---
SELECT  `news_firsts`.* FROM `news_firsts` WHERE `news_firsts`.`id` = 1 LIMIT 1