app/controllers/news_latests_controller.rb

  def index
    @news_latests = NewsLatest.all
---
SELECT `news_latests`.* FROM `news_latests`

  def create
    @news_latest = NewsLatest.new(news_latest_params)

    respond_to do |format|
      if @news_latest.save
---
INSERT INTO `news_latests` (`description`, `name`, `created_at`, `updated_at`) VALUES ('hhhh', 'hfgfg', '2019-02-14 17:23:39', '2019-02-14 17:23:39')

  def update
    respond_to do |format|
      if @news_latest.update(news_latest_params)
---
UPDATE `news_latests` SET `updated_at` = '2019-02-19 11:34:57' WHERE `news_latests`.`id` = 1

    def set_news_latest
      @news_latest = NewsLatest.find(params[:id])
---
SELECT  `news_latests`.* FROM `news_latests` WHERE `news_latests`.`id` = 1 LIMIT 1