app/controllers/sliders_controller.rb

SELECT `sliders`.* FROM `sliders`
---
  def index
    @sliders = Slider.all

INSERT INTO `sliders` (`heading`, `description`, `created_at`, `updated_at`) VALUES ('TEACHERS DAY', 'that was a great day ever', '2019-02-13 17:43:22', '2019-02-13 17:43:22')
---
  def create
    @slider = Slider.new(slider_params)

    respond_to do |format|
      if @slider.save

UPDATE `sliders` SET `updated_at` = '2019-02-13 17:43:22' WHERE `sliders`.`id` = 1
---
  def update
    respond_to do |format|
      if @slider.update(slider_params)

SELECT  `sliders`.* FROM `sliders` WHERE `sliders`.`id` = 1 LIMIT 1
---
    def set_slider
      @slider = Slider.find(params[:id])