app/controllers/stock_market_updates_controller.rb

  def index
    @stock_market_updates = StockMarketUpdate.all
---
SELECT `stock_market_updates`.* FROM `stock_market_updates`

  def create
    @stock_market_update = StockMarketUpdate.new(stock_market_update_params)

    respond_to do |format|
      if @stock_market_update.save
---
INSERT INTO `stock_market_updates` (`description`, `created_at`, `updated_at`) VALUES ('hfghjghj', '2019-02-19 11:45:54', '2019-02-19 11:45:54')

  def update
    respond_to do |format|
      if @stock_market_update.update(stock_market_update_params)
---
UPDATE `stock_market_updates` SET `updated_at` = '2019-02-19 11:52:21' WHERE `stock_market_updates`.`id` = 5

  def destroy
    @stock_market_update.destroy
---
DELETE FROM `stock_market_updates` WHERE `stock_market_updates`.`id` = 1

    def set_stock_market_update
      @stock_market_update = StockMarketUpdate.find(params[:id])
---
SELECT  `stock_market_updates`.* FROM `stock_market_updates` WHERE `stock_market_updates`.`id` = 1 LIMIT 1