app/controllers/stride_controller.rb

SELECT  `logos`.* FROM `logos` ORDER BY `logos`.`id` ASC LIMIT 1 OFFSET 1
SELECT `menus`.* FROM `menus`
SELECT `sliders`.* FROM `sliders`
---
  def home
  	@logos = Logo.all
  	@menus = Menu.all
  	@sliders = Slider.all