app/controllers/training_blogs_controller.rb

  def index
    @training_blogs = TrainingBlog.all
---
SELECT `training_blogs`.* FROM `training_blogs`

  def create
    @training_blog = TrainingBlog.new(training_blog_params)

    respond_to do |format|
      if @training_blog.save
---
INSERT INTO `training_blogs` (`description`, `name`, `created_at`, `updated_at`) VALUES ('fdfdfdfd', 'fdfdfdf', '2019-02-19 12:08:34', '2019-02-19 12:08:34')

  def update
    respond_to do |format|
      if @training_blog.update(training_blog_params)
---
UPDATE `training_blogs` SET `updated_at` = '2019-02-19 12:08:34' WHERE `training_blogs`.`id` = 1

    def set_training_blog
      @training_blog = TrainingBlog.find(params[:id])
---
SELECT  `training_blogs`.* FROM `training_blogs` WHERE `training_blogs`.`id` = 1 LIMIT 1