app/controllers/training_videos_controller.rb

SELECT `training_videos`.* FROM `training_videos`
---
  def index
    @training_videos = TrainingVideo.all

INSERT INTO `training_videos` (`created_at`, `updated_at`, `caption`) VALUES ('2019-02-19 12:22:49', '2019-02-19 12:22:49', 'dfdfdsfdfd')
---
  def create
    @training_video = TrainingVideo.new(training_video_params)

    respond_to do |format|
      if @training_video.save

UPDATE `training_videos` SET `updated_at` = '2019-02-19 12:22:14' WHERE `training_videos`.`id` = 4
---
  def update
    respond_to do |format|
      if @training_video.update(training_video_params)

DELETE FROM `training_videos` WHERE `training_videos`.`id` = 1
---
  def destroy
    @training_video.destroy

SELECT  `training_videos`.* FROM `training_videos` WHERE `training_videos`.`id` = 1 LIMIT 1
---
    def set_training_video
      @training_video = TrainingVideo.find(params[:id])